jlpoltrack/stm32ll-lib/src/stdstm32-i2c.h
//*******************************************************
// Copyright (c) OlliW, OlliW42, www.olliw.eu
// GPL3
// https://www.gnu.org/licenses/gpl-3.0.de.html
//*******************************************************
// STM32Cube HAL based I2C standard library
//*******************************************************
// a bit limited so far !!!
//
// Interface:
//
// #define I2C_USE_I2C1, I2C_USE_I2C2, I2C_USE_I2C3
//
// #define I2C_USE_ITMODE
// #define I2C_IT_IRQ_PRIORITY // may also be needed for DMA mode !
//
// #define I2C_USE_DMAMODE
// #define I2C_DMA_PRIORITY
// #define I2C_DMA_IRQ_PRIORITY
//
// #defined I2C_CLOCKSPEED_100KHZ
// #defined I2C_CLOCKSPEED_400KHZ
// #defined I2C_CLOCKSPEED_1000KHZ
//
//*******************************************************
#ifndef STDSTM32_I2C_H
#define STDSTM32_I2C_H
#ifdef __cplusplus
extern "C" {
#endif
#if !defined STM32C5 && !defined HAL_I2C_MODULE_ENABLED
  // C5 does not need it, its arm below is LL only
  #error HAL_I2C_MODULE_ENABLED not defined, enable it in Core\Inc\stm32yyxx_hal_conf.h!
#endif


//-------------------------------------------------------
// Defines
//-------------------------------------------------------

#include "stdstm32-peripherals.h"

#if defined I2C_USE_I2C1
  #define I2C_I2Cx               I2C1
#ifdef STM32F1  
  #define I2C_SCL_IO             IO_PB6
  #define I2C_SDA_IO             IO_PB7
  #define I2C_SCL_IO_AF          IO_AF_DEFAULT
  #define I2C_SDA_IO_AF          IO_AF_DEFAULT
  
  #define I2C_EV_IRQn            I2C1_EV_IRQn
  #define I2C_ER_IRQn            I2C1_ER_IRQn
  #define I2C_EV_IRQHandler      I2C1_EV_IRQHandler
  #define I2C_ER_IRQHandler      I2C1_ER_IRQHandler

  #define I2C_TX_DMAx_Channely_IRQn        DMA1_Channel6_IRQn
  #define I2C_RX_DMAx_Channely_IRQn        DMA1_Channel7_IRQn
  #define I2C_TX_DMAx_Channely_IRQHandler  DMA1_Channel6_IRQHandler
  #define I2C_RX_DMAx_Channely_IRQHandler  DMA1_Channel7_IRQHandler
#elif defined STM32WL
  #define I2C_SCL_IO             IO_PA9
  #define I2C_SDA_IO             IO_PA10
  #define I2C_SCL_IO_AF          IO_AF_4
  #define I2C_SDA_IO_AF          IO_AF_4

  #define I2C_EV_IRQn            I2C1_EV_IRQn
  #define I2C_ER_IRQn            I2C1_ER_IRQn
  #define I2C_EV_IRQHandler      I2C1_EV_IRQHandler
  #define I2C_ER_IRQHandler      I2C1_ER_IRQHandler

  #define I2C_TX_DMAx_Channely_IRQn        DMA1_Channel2_IRQn
  #define I2C_RX_DMAx_Channely_IRQn        DMA1_Channel1_IRQn
  #define I2C_TX_DMAx_Channely_IRQHandler  DMA1_Channel2_IRQHandler
  #define I2C_RX_DMAx_Channely_IRQHandler  DMA1_Channel1_IRQHandler
#elif defined STM32G4
  #define I2C_SCL_IO             IO_PA13
  #define I2C_SDA_IO             IO_PA14
  #define I2C_SCL_IO_AF          IO_AF_4
  #define I2C_SDA_IO_AF          IO_AF_4

  #define I2C_EV_IRQn            I2C1_EV_IRQn
  #define I2C_ER_IRQn            I2C1_ER_IRQn
  #define I2C_EV_IRQHandler      I2C1_EV_IRQHandler
  #define I2C_ER_IRQHandler      I2C1_ER_IRQHandler

  #define I2C_TX_DMAx_Channely_IRQn        DMA1_Channel2_IRQn
  #define I2C_RX_DMAx_Channely_IRQn        DMA1_Channel1_IRQn
  #define I2C_TX_DMAx_Channely_IRQHandler  DMA1_Channel2_IRQHandler
  #define I2C_RX_DMAx_Channely_IRQHandler  DMA1_Channel1_IRQHandler
#elif defined STM32C5
  // PB6/PB7 also carry I2C1 on C5, but are usually taken by LPUART1
  #define I2C_SCL_IO             IO_PB8
  #define I2C_SDA_IO             IO_PB9
  #define I2C_SCL_IO_AF          IO_AF_4
  #define I2C_SDA_IO_AF          IO_AF_4

  #define I2C_EV_IRQn            I2C1_EV_IRQn
  #define I2C_ER_IRQn            I2C1_ER_IRQn
  #define I2C_EV_IRQHandler      I2C1_EV_IRQHandler
  #define I2C_ER_IRQHandler      I2C1_ER_IRQHandler
#else
  #error Error in stdstm32-i2c.h, selected I2C1 not supported !
#endif

#elif defined I2C_USE_I2C2 || defined I2C_USE_I2C2_PB13PB14
  #define I2C_I2Cx               I2C2
#ifdef STM32WL
#if defined I2C_USE_I2C2
  #define I2C_SCL_IO             IO_PA12
  #define I2C_SDA_IO             IO_PA11
  #define I2C_SCL_IO_AF          IO_AF_4
  #define I2C_SDA_IO_AF          IO_AF_4
#else
  #error Error in stdstm32-i2c.h, selected USE_I2C2 not supported !
#endif
  #define I2C_EV_IRQn            I2C2_EV_IRQn
  #define I2C_ER_IRQn            I2C2_ER_IRQn
  #define I2C_EV_IRQHandler      I2C2_EV_IRQHandler
  #define I2C_ER_IRQHandler      I2C2_ER_IRQHandler

  #define I2C_TX_DMAx_Channely_IRQn        DMA1_Channel2_IRQn
  #define I2C_RX_DMAx_Channely_IRQn        DMA1_Channel1_IRQn
  #define I2C_TX_DMAx_Channely_IRQHandler  DMA1_Channel2_IRQHandler
  #define I2C_RX_DMAx_Channely_IRQHandler  DMA1_Channel1_IRQHandler
#elif defined STM32F0
#if defined I2C_USE_I2C2_PB13PB14
  #define I2C_SCL_IO             IO_PB13
  #define I2C_SDA_IO             IO_PB14
  #define I2C_SCL_IO_AF          IO_AF_5
  #define I2C_SDA_IO_AF          IO_AF_5
#else
  #error Error in stdstm32-i2c.h, selected USE_I2C2 not supported !
#endif
  #define I2C_IRQn               I2C2_IRQn
  #define I2C_IRQHandler         I2C2_IRQHandler

  #define I2C_TX_DMAx_Channely_IRQn        DMA1_Channel4_5_IRQn
  #define I2C_RX_DMAx_Channely_IRQn        DMA1_Channel4_5_IRQn
  #define I2C_TX_DMAx_Channely_IRQHandler  DMA1_Channel4_5_IRQHandler
  #define I2C_RX_DMAx_Channely_IRQHandler  DMA1_Channel4_5_IRQHandler
#else
  #error Error in stdstm32-i2c.h, selected I2C2 not supported !
#endif

#elif defined I2C_USE_I2C3
  #define I2C_I2Cx               I2C3
#ifdef STM32G4
  #define I2C_SCL_IO             IO_PC9
  #define I2C_SDA_IO             IO_PA8
  #define I2C_SCL_IO_AF          IO_AF_8 // GPIO_AF8_I2C3
  #define I2C_SDA_IO_AF          IO_AF_2 // GPIO_AF2_I2C3

  #define I2C_EV_IRQn            I2C3_EV_IRQn
  #define I2C_ER_IRQn            I2C3_ER_IRQn
  #define I2C_EV_IRQHandler      I2C3_EV_IRQHandler
  #define I2C_ER_IRQHandler      I2C3_ER_IRQHandler

  #define I2C_TX_DMAx_Channely_IRQn        DMA1_Channel2_IRQn
  #define I2C_RX_DMAx_Channely_IRQn        DMA1_Channel1_IRQn
  #define I2C_TX_DMAx_Channely_IRQHandler  DMA1_Channel2_IRQHandler
  #define I2C_RX_DMAx_Channely_IRQHandler  DMA1_Channel1_IRQHandler
#else
  #error Error in stdstm32-i2c.h, selected I2C3 not supported !
#endif

#else
  #error Error in stdstm32-i2c.h !
#endif
#ifndef I2C_I2Cx
  #error No I2C defined !
#endif


// allows us to overwrite the default pin assignment
#ifdef I2C_USE_SCL_IO
  #undef I2C_SCL_IO
  #define I2C_SCL_IO             I2C_USE_SCL_IO
#endif
#ifdef I2C_USE_SDA_IO
  #undef I2C_SDA_IO
  #define I2C_SDA_IO             I2C_USE_SDA_IO
#endif
#ifdef I2C_USE_IO_AF
  #undef I2C_IO_AF
  #define I2C_IO_AF              I2C_USE_IO_AF
#endif


#ifndef I2C_IT_IRQ_PRIORITY
  #define I2C_IT_IRQ_PRIORITY  15
#endif

#ifndef I2C_DMA_PRIORITY
  #define I2C_DMA_PRIORITY  DMA_PRIORITY_LOW
#endif
#ifndef I2C_DMA_IRQ_PRIORITY
  #define I2C_DMA_IRQ_PRIORITY  15
#endif

